# 张俊峰
[18576678816](tel:18576678816)  |  [hi@akii.me](mailto:hi@akii.me)

***
### 求职意向

工作性质：全职

目标职能：中高级iOS开发工程师

***
### 专业技能

***
### 项目经验

- 团个车

-   Netbot
Netbot是一个跨平台`EDA`网络代理框架，可供用户快速搭建HTTP，SOCKS5，Shadowsocks代理。

该项目基于`SwiftNIO`开发，使用`EventLoop`实现高并发。

- 邻趣 *2018.08 - 2018.10*
邻趣是一款社区类应用

-   铭源VR *2017.05 - 2017.07*

铭源VR是一款配合VR盒子使用的视频聚合产品，为用户提供虚拟现实视频观赏体验。

该项目使用`RxSwift`进行`FRP`编程，`Alamofire`处理网络数据请求，通过`CoreMotion`数据控制相机节点旋转以实现VR视觉效果，使用`SceneKit`以`SCNode`为基础进行自定义3D界面设计，视图控制模块分头控和手柄两种模式，其中手柄控制模块需配合固定产品，通过`Bluetooth`读取已连接手柄陀螺仪数据加以转换将其映射到3D界面中，再通过碰撞检测实现。播放器使用`ijkplayer`获取解码数据通过`OpenGL`将图像渲染到视图节点。

在该项目中负责需求分析、项目设计、及iOS端编码等工作。

-   汇通易贷V3 *2015.10 - 2016.09*

汇通易贷是深圳市汇通电子商务有限公司P2P网贷产品移动客户端，用户通过登陆客户端验证资产信誉后可进行相关债券买卖和借款操作。

该项目为`MVVM`架构，使用`ReactiveCocoa`进行函数响应式编程，数据安全方面使用`HTTPS`混合自定义算法进行数据加密防止`MitM`攻击，使用`Keychain`存储用户信息，取消`URLCache`，页面布局采用`XIB`配合`AutoLayout`进行，其他框架技术包括`AFNetworking`，异步图片处理框架`SDWebImage`，刷新控件`MJRefresh`，数据模型`Mantle`，及框架管理工具`CocoaPods`等。

在该项目中我作为主程负责项目搭建，框架设计编码，进度把控及之后的提审等流程。

-   A8体育 *2014.10 -2015.08*

A8体育是由云图TV独立出来的一款聚焦体育赛事节目的产品，主要由视频播放系统、新闻系统，用户系统和评论系统几大模块构成。

该软件为`MVC`架构使用`Objective-C`语言编写，以`Mantle`作为数据模型基础使用`CoreData`及**归档**进行数据持久化，使用`Mansory`进行自适应页面布局，网络模块以`ASIHTTPRequest`为基础整了合数据加解密、`cookie`、数据解析等功能。采用`SDWebImage`作为图片异步下载工具。视频播放系统采用`ijkplayer`播放器，支持`rtsp`、`rtmp`等格式视频播放。

在该项目中负责iOS端编码、后期上架及迭代维护等工作。

***
### 工作经验

-   深圳铭源电玩科技股份有限公司    *2016.12 - 2017.12*

编写项目设计文档，根据文档完成项目搭建，模块设计，编写核心业务代码。先后完成D01、C04、C05、铭源VR等项目。

-   佳科软件科技有限公司     *2015.08 - 2016.10*

根据软件设计文档带领小组成员完成项目搭建，相应模块编码，编写单元测试和代码维护

-   深圳新感易搜网络科技有限公司    *2014.09 - 2015.08*

按照项目设计文稿完成项目搭建，模块设计及编码工作。在职期间参与云图TV调试分发，独立完成A8体育代码编写，其中A8体育曾获得App Store娱乐榜第3的好成绩。

***
### 教育经历

广东石油化工学院 | 软件工程 | 本科    *2010.09 - 2014.07*

相关课程：算法与数据结构基础、C#、Android程序设计、软件工程

***
